### Import libraries

In [35]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

### Import data

In [37]:
# Create path
path = r'C:\Users\nanh9\Instacart Basket Analysis'

In [38]:
customers = pd.read_csv(os.path.join(path, '02 Data' , 'Original Data' , 'customers.csv'))

#### 4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [40]:
# Check data
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [41]:
customers.shape

(206209, 10)

In [42]:
# renaming columns
customers = customers.rename(columns={ 
    'First Name' : 'first_name',
    'Surnam' : 'last_name', 
    'STATE' : 'state',  
    'n_dependants' : 'dependents_count', 
    'fam_status' : 'family_status', 
    'Age' : 'age',
    'Gender' : 'gender'})

In [43]:
customers = customers.rename(columns={'User ID' : 'user_id'})

In [44]:
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,dependents_count,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [45]:
customers.describe()

             user_id            age  dependents_count         income
count  206209.000000  206209.000000     206209.000000  206209.000000
mean   103105.000000      49.501646          1.499823   94632.852548
std     59527.555167      18.480962          1.118433   42473.786988
min         1.000000      18.000000          0.000000   25903.000000
25%     51553.000000      33.000000          0.000000   59874.000000
50%    103105.000000      49.000000          1.000000   93547.000000
75%    154657.000000      66.000000          3.000000  124244.000000
max    206209.000000      81.000000          3.000000  593901.000000

#### 5. Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [47]:
# Find missing values
missing_values = customers.isnull().sum()

In [48]:
missing_values

user_id                 0
first_name          11259
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
dependents_count        0
family_status           0
income                  0
dtype: int64

In [49]:
# Fing duplicated rows
duplicates = customers.duplicated()

In [50]:
# Sum up total number of duplicates
num_duplicates = duplicates.sum()

In [51]:
num_duplicates

0

no duplicates

In [53]:
# Look up column types
customers.dtypes

user_id              int64
first_name          object
last_name           object
gender              object
state               object
age                  int64
date_joined         object
dependents_count     int64
family_status       object
income               int64
dtype: object

#### 6. Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [55]:
# Import dataframe
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'aggregated_ords_prods_merge.pkl'))

In [56]:
# Combine customer with ords_prods_merge
merged_df = pd.merge(ords_prods_merge, customers, on='user_id', how='inner')

In [57]:
# Check merge
merged_df.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,frequency_flag,first_name,last_name,gender,state,age,date_joined,dependents_count,family_status,income
0,1,Chocolate Sandwich Cookies,61,19,5.8,186761,186761,7,2,8,...,Frequent Customer,NaN,Morse,Male,Wisconsin,49,5/28/2018,0,single,111493
1,1,Chocolate Sandwich Cookies,61,19,5.8,200390,200390,4,2,0,...,Frequent Customer,Peter,Villegas,Male,Georgia,21,10/19/2018,1,living with parents and siblings,79894
2,1,Chocolate Sandwich Cookies,61,19,5.8,19989,19989,11,2,7,...,Frequent Customer,Marilyn,Lyons,Female,Washington,81,6/5/2019,2,married,112668
3,1,Chocolate Sandwich Cookies,61,19,5.8,138748,138748,30,3,16,...,Frequent Customer,NaN,Mason,Female,North Carolina,81,11/11/2017,3,married,164020
4,1,Chocolate Sandwich Cookies,61,19,5.8,49629,49629,18,1,14,...,Non_frequent_customer,Gregory,Cain,Male,Colorado,24,9/27/2017,3,married,100653

In [58]:
merged_df.shape

(1953168, 34)

In [59]:
merged_df.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_last_order', 'first_order',
       'add_to_cart_order', 'reordered', '_merge', 'price_range_loc',
       'busiest_day', 'busiest_days', 'busiest_period_of_day', 'max_order',
       'loyalty_flag', 'average_spend', 'spending_flag', 'Customer_frequency',
       'frequency_flag', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'dependents_count', 'family_status', 'income'],
      dtype='object')

In [60]:
# Drop unnecessary column '_merge'
merged_df = merged_df.drop(columns=['_merge'])

#### 7. Ensure your notebook contains logical titles, section headings, and descriptive code comments.

#### 8. Export data

In [63]:
merged_df.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cust_merge.pkl'))